Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Generators are implemented via inner functions. Just like inner functions used elsewhere in the language, variables from the enclosing scope can be "captured" in the inner function. For example, sum(p[i] - q[i] for i=1:n)
ja: ジェネレータは内部機能によって実装されています。 言語で他の場所で使用される内部関数、囲みスコープからの変数は、次のようになります。 "捕獲された"内部関数では、例えばsum(p[i]-q[i]for i=1:n)

source: Given a Ptr{T}, the contents of type T can generally be copied from the referenced memory into a Julia object using unsafe_load(ptr, [index]).
ja: Ptr{T}を与えられると、タイプTの内容は、一般的に参照されたメモリからコピーされる。 unsafe_load(ptr,[index])を使用してジュリアオブジェクトに変換します。

source: Given a dictionary D, the syntax D[x] returns the value of key x (if it exists) or throws an error, and D[x] = y stores the key-value pair x => y in D (replacing any existing value for the key x).
ja: 辞書Dを与えられると、構文D[x]は、キーx(存在する場合)の値を返すか、あるいはスローします。 エラーとD[x]=yは、D(既存の値を置き換える)のx=>yのキー値ペアを格納します。 xx14/>)。

source: Given an expression object, one can cause Julia to evaluate (execute) it at global scope using `eval`:
ja: エクスプレッションオブジェクトを指定すると、次のようにして、グローバルスコープでJuliaを評価(実行)することができます。 `eval':

source: Given this roots map, in App's code the statement import Priv will cause Julia to look up roots[:Priv], which yields ba13f791-ae1d-465a-978b-69c3ad90f72b, the UUID of the Priv package that is to be loaded in that context.
ja: のrootマップを指定すると、のAppのコードでは、import Privは、のルート[:Priv]を検索します。は、そのコンテキスト内にロードされるPrivパッケージのba13f791-ae1d-465a-978b-69c3ad90f72bを生成します。

source: Given this dependency graph, when Julia sees import Priv in the Pub package—which has UUID c07ecb7d-0dc9-4db7-8803-fadaaeaf08e1—it looks up:
ja: この依存性グラフを指定すると、PubのPubパッケージでのインポートPrivを確認すると、次のようになります。c07ecb7d-0dc9-4db7-8803-fadaaeaf08e1

source: Global variables exported by native libraries can be accessed by name using the `cglobal`
ja: ネイティブライブラリによってエクスポートされたグローバル変数は、`cglobal`を使用して名前によってアクセスできます。

source: Good performance, approaching that of statically-compiled languages like C
ja: Cのような静的コンパイル言語に迫る性能を実現します

source: Half-precision floating-point numbers are also supported (Float16), but they are implemented in software and use Float32 for calculations.
ja: 半精度浮動小数点数もサポートされている(Float16)が、これらの浮動小数点数は次のようになります。 ソフトウェアで実装され、Float32 を使用して計算に使用されます。

source: Half-precision floating-point numbers are also supported (`Float16`), but they are implemented in software and use `Float32` for calculations.
ja: 半制度浮動小数点数もサポートされていますが（(`Float16` ）、保存形式のみとして使用が可能です。 計算時には、それらは `Float32` に変換されます。:

source: Hence, expressions starting with a numeric literal followed by F are interpreted as the numerical literal multiplied by a variable, which means that, for example, 1.5F22 is equal to 1.5 * F22.
ja: したがって、数値リテラルで始まる式 続いてFは、数値的リテラル乗算された数値を変数で乗算したものと解釈されます。これは 例:1F22は、1.5*F22と等しくなります。

source: Here are some examples to demonstrate which type of arrays are strided and which are not:
ja: ここでは、どのタイプのアレイがストローブされていて、どのタイプがストライドされていないかを示す例をいくつか示します。

source: Here are some examples with bitwise operators:
ja: 以下はビット単位演算子の例です。

source: Here are some simple examples using arithmetic operators:
ja: 以下は算術演算の例です。

source: Here are some simple examples:
ja: 簡単な例を次に示します。

source: Here are some situations where syntactic conflicts arise:
ja: 以下は構文の競合が発生する状況の例です。

source: Here is a corresponding roots structure, represented as a dictionary:
ja: 辞書として表される、対応する根構造を次に示す。

source: Here is a representation of the paths map for the App project environment:
ja: アプリケーションプロジェクト環境のパスマップの表現を次に示します。

source: Here is a second example wrapping the corresponding destructor:
ja: 次に、対応するデストラクタをラップする2番目の例を示します。

source: Here is a simple example of a C wrapper that returns a Ptr type:
ja: ここでは、Ptr型を返すCラッパーの簡単な例を次に示します。

source: Here is a simple example:
ja: 簡単な例を次に示します。

source: Here is a simple, motivating example:
ja: 簡単な動機付けの例を次に示します。

source: Here is a slightly more complex example that discovers the local machine's hostname:
ja: ここでは、ローカルマシンのホスト名を検出するもう少し複雑な例を示します。

source: Here is a third example passing Julia arrays:
ja: 次に、Julia配列を渡す3番目の例を示します。

source: Here is an example of a while loop:
ja: whileループの例を次に示します。

source: Here is an extraordinarily simple macro:
ja: 簡単な例を次に示します。

source: Here is example of the short form used to quote an arithmetic expression:
ja: 算術式の引用に使用される短い形式の例を次に示します。

source: Here is how Char values are input and shown:
ja: har 値の入力と表示方法は以下の通りです。:

source: Here is the anatomy of the if-elseif-else conditional syntax:
ja: ここで、 if-elseif-else型の条件分岐構文を解剖してみましょう

source: Here is the corresponding graph structure, represented as a dictionary:
ja: 辞書として表される対応するグラフ構造を次に示す。

source: Here it is in action:
ja: 例を挙げると、

source: Here the 1:5 is a Range object, representing the sequence of numbers 1, 2, 3, 4, 5.
ja: この1:5は、Rangeオブジェクトで、1,2,3,4,5の数列をあらわしています。

source: Here the 1:5 is a range object, representing the sequence of numbers 1, 2, 3, 4, 5.
ja: ここで、1:5は、番号1 2 3 4 5のシーケンスを表す範囲オブジェクトである。

source: Here the call g(2.0, 3.0) could be handled by either the g(Float64, Any) or the g(Any, Float64)
ja: ここでの関数呼び出しg(2.0, 3.0)は、g(Float64, Any)とg(Any, Float64) のメソッドによって処理可能ですが、どちらがより特化しているかは決められません。 このような場合、Juliaは勝手にメソッドを選択せずに、MethodErrorを発生させます。 共通する場合に特化したメソッドを指定することで、メソッドの曖昧さをなくすことができます。

source: Here the zero-argument constructor method calls the single-argument constructor method, which in turn calls the automatically provided two-argument constructor method.
ja: ここでは、0つの引数コンストラクタメソッドは、単一引数コンストラクタメソッドを呼び出します。 は自動的に提供された2引数コンストラクタメソッドを呼び出します。

source: Here we created a function change_array!, that assigns 5 to the first element of the passed array (bound to x at the call site, and bound to A within the function).
ja: ここでは、渡された第1の要素に5を割り当てる関数change_array!を作成しました。 array(xat the call site,and bound to the function in the function内でAにバインドされます)。

source: Here's an example illustrating the display on a nested Expr:
ja: 次に例を示します ネストされたExpr上の表示

source: Here's an example of a begin block:
ja: begin>¥ブロックの例を次に示します。

source: Here's an example where the method type parameter T is used as the type parameter to the parametric type Vector{T} in the method signature:
ja: メソッドの型パラメータTが、メソッドのシグネチャのパラメトリック型に対する型パラメータVector{T}として使用される例を次に示します。

source: Here, (2, 3) is a `Tuple`.
ja: ここで、(2, 3)は、「タプル」である。

source: Here, for example, is another attempt at defining the SelfReferential type, this time using a zero-argument inner constructor returning instances having obj fields pointing to themselves:
ja: ここでは、別の試みを行います。 SelfReferentialタイプを定義する際には、0つの引数内部コンストラクタを使用してインスタンスを返します。 objフィールドが自分自身を指していることを示します。

source: Here, the evaluation of an expression object causes a value to be assigned to the global variable x.
ja: ここで、エクスプレッションオブジェクトの評価によって、グローバル変数に値が割り当てられます。 x。

source: Here, the input p is declared to be of type Ref{gsl_permutation}, meaning that the memory that p points to may be managed by Julia or by C. A pointer to memory allocated by C should be of type Ptr{gsl_permutation}, but it is convertible using `Base.cconvert` and therefore can be used in the same (covariant) context of the input argument to a `ccall`.
ja: ここで、入力pは、タイプRef{gsl_mutation}であることを宣言され、メモリは、メモリを意味する。 pは、ジュリアまたはC.Aポインタによって割り当てられたメモリへのC.Aポインタによって管理されることがあります。 Ptr{gsl mutation}であるが、'Base.チコンベルト'を用いて変換することができ、したがって は、`ccall'への入力引数の同じ(共変)コンテキストで使用することができます。

source: Hexadecimal floating-point literals are also valid, but only as Float64 values, with p preceding the base-2 exponent:
ja: 16進数浮動小数点リテラルは有効であるが、'Float64の値としてのみ有効である。 pは、ベース2指数の前にあります。

source: Hexadecimal floating-point literals are also valid, but only as `Float64` values, with p preceding the base-2 exponent:
ja: 16進数浮動小数点リテラルは有効であるが、'Float64の値としてのみ有効である。 pは、ベース2指数の前にあります。

source: Hexadecimal floating-point literals are also valid, but only as `Float64` values:
ja: 16進数の浮動小数点リテラルも有効ですが、 `Float64` 値としてのみ使用が可能です。:

source: How can I modify the declaration of a type in my session?
ja: セッション内のタイプの宣言を変更するにはどうすればよいですか。

source: How do I catch CTRL-C in a script?
ja: スクリプトでCTRL-Cを取得するにはどうすればよいですか。

source: How do I check if the current file is being run as the main script?
ja: メインスクリプトとして現在のファイルが実行されているかどうかを確認するにはどうすればよいですか。

source: How do I pass options to julia using !/usr/bin/env?
ja: !/usr/bin/env?を使用して、ジュリアにオプションを渡す方法を教えてください。

source: How this distinction works is determined by environments, as explained in the following sections.
ja: この区別の仕組みは、次のセクションで説明するように、環境によって決まります。

source: However, even for immutable structs it will not cause any harm for called functions to attempt such modifications (that is, writing through the passed pointers).
ja: しかし 不変構造体でさえ、呼び出された関数がこのような修正を試みることを妨げることはないでしょう。 (つまり、渡されたポインタを通して書くこと)。

source: However, all the information we need for the loop is embedded in the type information of the arguments.
ja: しかし、ループに必要なすべての情報は、引数の型情報に埋め込まれています。

source: However, any concrete AbstractArray{T,N} type should generally implement at least `size(A)` (returning an Int tuple), `getindex(A,i)` and (@ref getindex); mutable arrays should also implement `setindex!`.
ja: しかし、具体的なAbstractArray{T,N}型は、一般的には実装されるべきである。 'size(A)'(return anIntタプルを返す)`getindex(A,i)`(@ref getindex); mutable配列は、`setindex!`を実装する必要があります。

source: However, doing this will also be very slow and leak memory, so you should usually avoid this and instead keep reading.
ja: しかし、これは非常に低速でリークメモリもあるので、通常はこれを避けてから、読み続けてください。

source: However, for efficiency, Julia's package loading code does not actually create them.
ja: しかし、効率を上げるために、Juliaのパッケージロードコードは実際には作成されません。

source: However, future calls to tryeval will continue to see the definition of newfun as it was at the previous statement at the REPL, and thus before that call to tryeval.
ja: しかし、tryevalへの今後の呼び出しが、参照し続けるnewfunの定義は、次回tryevalを呼び出すまではREPLで前回行ったものです。前回のtryevalの呼び出しも同様だったのです。

source: However, if needed you can specialize on any or all of these arguments.
ja: ただし、必要に応じて、これらの引数のいずれかまたはすべてを専門にすることができます。

source: However, in some cases more functionality is required when creating composite objects.
ja: ただし、場合によっては、次のような機能が必要になります。 合成オブジェクトを作成します。

source: However, in some cases one would rather not provide inner constructors, so that specific type parameters cannot be requested manually.
ja: しかし、場合によっては、内部コンストラクタを提供しなくてもよい場合があります。 特定のタイプパラメータを手動で要求することはできません。

source: However, in some situations it is necessary to quote code without performing interpolation.
ja: しかし、状況によっては、を実行せずに、コードを引用符で括る必要があります。

source: However, it is possible to use computed values as function names by staging through `eval` as follows:
ja: しかし、それは可能である。 次のように'eval'を通してステージングすることによって関数名として計算された値を使用することができます。

source: However, not all object fields are references.
ja: ただし、すべてのオブジェクト・フィールドが 参照。

source: However, numeric literal coefficients parse similarly to unary operators when combined with exponentiation.
ja: しかし、数値リテラル係数は、次のように単項演算子と同じように解析されます。 指数関数と組み合わせます。

source: However, other similar calls still don't work:
ja: しかし、その他の類似したコールはまだ機能していない。

source: However, the fallback methods for +(a, b, c, d...) and *(a, b, c, d...) both default to left-associative evaluation.
ja: ただし、+(a, b, c, d...)および*(a, b, c, d...)両方のフォールバック方法は、デフォルトでは左連想評価に使用されています。

source: However, the manner in which this rounding is done can be changed if required according to the rounding modes presented in the IEEE 754 standard.
ja: しかし、この丸めが行われる方法は IEEE754で提示された丸めモードに従って必要に応じて変更された 標準的な。

source: However, the order of evaluations in a chained comparison is undefined.
ja: しかし、連続した比較の処理順は 定義されていません。

source: However, the outer quote expression is able to interpolate values inside the $
ja: しかし、外側の引用符の式は、$の範囲内での値を補間することができます。

source: However, the signatures of method definitions can be annotated to indicate the types of arguments in addition to their number, and more than a single method definition may be provided.
ja: しかし、メソッド定義のシグネチャに、型注釈をつけると、引数の型と数を指定でき、複数のメソッド定義を与えることができます。

source: However, these subtleties are described in detail in most books on scientific computation, and also in the following references:
ja: しかし、応用的な知識は科学技術計算に関する書籍や以下参考に詳細が記載されています。

source: However, this is not recommended.
ja: しかし、これは推奨されないである。

source: However, this is obviously not recommended to avoid potential confusion.
ja: しかし、これは混乱を避ける目的で、推奨されていません。

source: However, this need not always be the case.
ja: しかし、必ずこうする必要はなく、

source: However, type promotion between the primitive types above and `BigInt`/`BigFloat`
ja: しかし、上記のプリミティブ型と`BigInt` または `BigFloat` 間の型変換は、自動では行われず、 明示的に指定する必要があります。

source: However, when depending on this behavior, make sure all possible code paths define a value for the variable.
ja: ただし この動作では、可能なすべてのコード・パスが変数の値を定義していることを確認してください。

source: However, which implementation is used depends on compiler implementation details, so it is essential for the two implementations to behave identically.
ja: しかし、どの実装が使用されるのかは、コンパイラの実装の詳細に依存します。 2つの実装が同じように動作するためには必須です。

source: However, while the type layout must be known statically to compute the intended C ABI, the static parameters of the function are considered to be part of this static environment.
ja: しかし、意図されたC ABIを計算するためには、タイプレイアウトは静的に認識される必要があります。 関数の静的パラメータは、この静的環境の一部であると見なされます。

source: However, you can create variables with names: abstract, mutable, primitive and type.
ja: ただし、名前を使用して変数を作成することはできます。 抽象,mutable,プリミティブ,。

source: I passed an argument x to a function, modified it inside that function, but on the outside, the variable x is still unchanged.
ja: 関数に対して引数x2/>を渡したが、その関数内で修正されたが、外側では変数xは変更されないままであった。

source: If A is an AbstractArray{T,0}, this should return an empty tuple.
ja: AがAbstractArray{T,0}である場合、この値は空のタプルを返します。

source: If I_1 is changed to a two-dimensional matrix, then X becomes an n+1-dimensional array of shape (size(I_1, 1), size(I_1, 2), length(I_2), ..., length(I_n)).
ja: I_1が2次元マトリクスに変化すると、Xはn+1次元配列となる。 形状(サイズ(I_1 1)、サイズ(I_1 2)、長さ(I_2)、.…、長さ(I_n))。

source: If I_1 is changed to a two-dimensional matrix, then X becomes an n+1-dimensional array of shape (size(I_1, 1), size(I_1, 2), length(I_2), ..., length(I_n)). The matrix adds a dimension.
ja: I_1が2次元マトリクスに変化すると、Xはn+1次元配列となる。 形状(サイズ(I_1 1)、サイズ(I_1 2)、長さ(I_2)、…、長さ(I_n))。マトリックスは次元を追加します。

source: If T is Any, then the memory is assumed to contain a reference to a Julia object (a jl_value_t*), the result will be a reference to this object, and the object will not be copied.
ja: Tがであれば、メモリはジュリアオブジェクトへの参照を含むものと仮定します(jl_value_t*)。 結果はこのオブジェクトへの参照になり、オブジェクトはコピーされません。

source: If T is a floating-point type, the result is the nearest representable value, which could be positive or negative infinity.
ja: Tが浮動小数点型の場合、変換の結果は最も近い表現可能な、正または負の無限大にもなり得る値になります。

source: If T is an integer type, an InexactError is raised if x is not representable by T.
ja: TT が整数型の場合、 x が />Tで表現できない際はInexactErrorが発生します。

source: If X/Project.toml does not exist, then uuid is the all-zero nil UUID.
ja: X/Project.トミルが存在しない場合、uuidはすべてゼロnil UUIDである。

source: If X/Project.toml exists and but does not have a top-level UUID entry, uuid is a dummy UUID generated by hashing the canonical path of X/Project.toml.
ja: X/Project.トミルが存在していてもがトップレベルUUIDエントリを持たない場合、uuidは、X/Project.Menuの正規パスをハッシュすることによって生成されるダミーUUIDである。トミル。

source: If X/Project.toml exists and has a uuid entry, then uuid is that value.
ja: X/Project.トミルが存在し、uuidエントリが存在する場合は、uuidはその値です。

source: If X is an array, it must have the same number of elements as the product of the lengths of the indices: prod(length(I_1), length(I_2), ..., length(I_n)).
ja: Xが配列である場合、それは長さの積と同じ数の要素を持つ必要があります。 インデックス:prod(長さ(I_1),長さ(I_2),…,長さ(I_n))。

source: If X is an array, it must have the same number of elements as the product of the lengths of the indices: prod(length(I_1), length(I_2), ..., length(I_n)). The value in location I_1[i_1], I_2[i_2], ..., I_n[i_n]
ja: Xが配列である場合、それは長さの積と同じ数の要素を持つ必要があります。 インデックス:prod(長さI_1)、長さ(I_2)、…、長さ(I_n)。位置I_1[i_1]の値、I_2[i_2]、.…、I_n[i_n]

source: If a is an instance of SelfReferential, then a second instance can be created by the call:
ja: aがSelfReferentialのインスタンスである場合は、次のように呼び出しによって2番目のインスタンスを作成することができます。

source: If fussy_sqrt is called with a negative value from another function, instead of trying to continue execution of the calling function, it returns immediately, displaying the error message in the interactive session:
ja: もしfusy_sqrtが別の関数から負の値を持って呼び出された場合、それは継続される代わりに 呼び出し関数の実行で、ただちにエラー・メッセージが表示されます。 対話型セッション:

source: If include("source.jl") is called multiple times, source.jl is evaluated multiple times.
ja: が("source.jl")を含む場合、は複数回呼び出されます。source.jlは複数回評価されます。

source: If X is a subdirectory of a package directory and X/src/X.jl exists, then the package X is available in the package directory environment and X/src/X.jl is the source file by which it is loaded.
ja: Xがパッケージディレクトリのサブディレクトリであり、X/src/X.jlが存在する場合、パッケージXは、パッケージディレクトリ環境で使用可能であり、X/src/X.jlは、それがロードされるソースファイルである。

source: If X is not an array, its value is written to all referenced locations of A.
ja: Xが配列でない場合は、その値は は、Aの参照されたすべての場所に書き込まれます。

source: If Ptr{Cdouble} were used instead, the `ccall` may still work, but Julia's garbage collector would not be aware that the memory declared for result_array is being used by the external C function.
ja: もしPtr{Cdouble}が代わりに使われたとしたら、`ccall'は依然として動作しますが、ジュリアのゴミはまだ動作していません。 コレクタは、result_arrayのために宣言されたメモリが使用されていないことを認識しません。 外部C関数です。

source: If a C/C++ routine has an argument or return value that is a native SIMD type, the corresponding Julia type is a homogeneous tuple of VecElement that naturally maps to the SIMD type.
ja: C/C++ルーチンに、ネイティブSIMD型の引数または戻り値がある場合は、対応する Julia型は、自然にSIMD型にマッピングされるVecElementの同種のタプルである。

source: If a function argument name is written as a tuple (e.g. (x, y)) instead of just a symbol, then an assignment (x, y) = argument will be inserted for you:
ja: 関数引数の名前がタプル(例えば(x, y))ではなく、タプルとして記述されている場合 次に、割り当て(x, y)=引数が挿入されます。

source: If a number doesn't have an exact floating-point representation, it must be rounded to an appropriate representable value.
ja: 数値が正確な浮動小数点表現を持たない場合は、次のように丸めます。 適切な表現可能な値。

source: If a number doesn't have an exact floating-point representation, it must be rounded to an appropriate representable value, however, if wanted, the manner in which this rounding is done can be changed according to the rounding modes presented in the IEEE 754 standard.
ja: 値が割り切れる浮動小数点数ではない場合、適切な表現可能な値に繰り上げる必要があります。 しかし、必要な場合は、どのように繰り上げするかは IEEE 754規格 の 端数処理モードに準拠して変更が可能です。。

source: If a package subdirectory has a project file, then the graph entry for its UUID is the [deps] map of the project file, which is considered to be empty if the section is absent.
ja: パッケージサブディレクトリがプロジェクトファイルを持っている場合、そのUUIDのグラフエントリはプロジェクトファイルの[deps]マップであり、セクションが存在しない場合は空であると見なされます。

source: If a package subdirectory has no project file, then it is omitted from graph and import statements in its code are treated as top-level, the same as the main project and REPL.
ja: パッケージサブディレクトリにプロジェクトファイルがない場合は、グラフからは省略され、コード内のインポートステートメントは最上位のプロジェクトと同じように扱われ、REPLと同じように扱われます。

source: If a pointer conversion method `Base.unsafe_convert(Ptr{T}, A)` is provided, the memory layout must correspond in the same way to these strides.
ja: ポインタ変換方法`Base.unsafe_convert(Ptr{T},A)`がある場合 この場合、メモリレイアウトは、これらの進歩と同じ方法で対応する必要があります。

source: If a type is defined as a subtype of AbstractArray, it inherits a very large set of rich behaviors including iteration and multidimensional indexing built on top of single-element access.
ja: もしタイプがAbstractArrayのサブタイプとして定義されるなら、それは非常に大きな一連の豊かな振る舞いを継承する。 単一要素アクセスの上に構築された反復と多次元索引付けを含む。

source: If all arguments have a common (@ref conversion-and-promotion) then they get converted to that type using `convert`.
ja: すべて 引数には共通の(@ref conversion-and-promotion)があります。 'convert`を使用して、そのタイプに変換されます。

source: If all indices are vectors, for example, then the shape of X would be (length(I_1), length(I_2), ..., length(I_n)), with location (i_1, i_2, ..., i_n) of X containing the value A[I_1[i_1], I_2[i_2], ..., I_n[i_n]].
ja: 例えば、すべてのインデックスがベクトルである場合、Xの形状は(長さI_1)、長さ(I_2)、…、長さ(I_n)である。 位置(i_1,i_2,.…i_n)Xの値A[I_1[i_1],I_2[i_2],.…,I_n[i_n]].

source: If all the indices are scalars, then the result X is a single element from the array A.
ja: すべての指標がスカラーである場合、結果Xは、配列Aからの単一要素である。

source: If all the indices are scalars, then the result X is a single element from the array A. Otherwise, X is an array with the same number of dimensions as the sum of the dimensionalities of all the indices.
ja: すべてのインデックスがスカラーである場合、結果Xは、配列Aからの単一要素である。それ以外の場合は xは、すべての次元の次元性の合計と同じ数の次元を持つ配列です。 索引。

source: If an array of eltype Ptr{T} is passed as a Ptr{Ptr{T}} argument, `Base.cconvert`
ja: エルテープPtr{T}の配列がPtr{Ptr{T}}引数として渡された場合、'Base.チコンベルト'

source: If an expression is entered into an interactive session with a trailing semicolon, its value is not shown.
ja: 式の後ろにセミコロンをつけて入力すると、値は表示されません。

source: If any inner constructor method is defined, no default constructor method is provided: it is presumed that you have supplied yourself with all the inner constructors you need.
ja: 内部コンストラクタメソッドが定義されている場合は、デフォルトのコンストラクタメソッドは提供されません。これは 必要なすべてのインナー・コンストラクターを自分で提供しています。

source: If applying these rules doesn't find a loadable path, the package should be considered not installed and the system should raise an error or prompt the user to install the appropriate package version.
ja: これらのルールを適用してもロード可能なパスが見つからない場合、パッケージはインストールされていないと見なされ、システムはエラーまたはプロンプトを表示して、適切なパッケージバージョンをインストールするようユーザーに指示する必要があります。

source: If instead you want to specialize on the destination type DestType without specializing on DestStyle, then you should define a method with the following signature:
ja: その代わりに、宛先タイプDestTypeに特化する必要はありません。 DestStyleでは、次のシグニチャを使用してメソッドを定義する必要があります。

source: If memory usage is your concern, you can always replace objects with ones that consume less memory.
ja: メモリ使用量が問題になる場合は、常にメモリを消費するオブジェクトを使用してオブジェクトを置き換えることができます。

source: If needed, the sorting algorithm can be chosen:
ja: 必要に応じて、ソート・アルゴリズムを選択できます。

source: If one of the arguments is a 64-bit float but the other one is not, then the f(Float64,Float64) method cannot be called and the more general f(Number,Number) method must be used:
ja: 引数の1つが64ビット浮動小数点数で、もう1つがそうでない場合、このf(Float64,Float64)メソッドは呼び出すことができず、より一般的なf(Number,Number) メソッドを使用する必要があります。:

source: If proper finalization of a depends on b being valid, it must be handled in other ways.
ja: aの適切なファイナライズは、bが有効であることによって異なります。 他の方法で処理する必要があります。

source: If side effects are required, the short-circuit && operator should be used explicitly (see Short-Circuit Evaluation).
ja: 副次効果が必要な場合は、短絡 && 演算子を明示的に使用する必要があります。（ 短絡評価 Short-Circuit Evaluation参照）

source: If such code encounters non-ASCII text, it will gracefully fail with a clear error message, rather than silently introducing corrupt results.
ja: JuliaはASCII以外のテキストが検出された場合、エラーをただ出力するのではなく、明確なエラーメッセージを出力して処理を終了します。

source: If the own parameter is omitted or false, the caller must ensure the buffer remains in existence until all access is complete.
ja: の 独自のパラメータは省略されるか、またはfalseであるため、呼び出し側はバッファが存在しないことを確認する必要があります。 すべてのアクセスが完了しました。

source: If the Ptr itself is actually a jl_value_t*, it can be converted back to a Julia object reference by `unsafe_pointer_to_objref(ptr)`.
ja: Ptr自身が実際にjl_value_t*である場合、それは変換されることができる。 `unsafe_pointer_to_objref(ptr)`でJuliaオブジェクト参照に戻ります。

source: If the C wrapper never expects the user to pass pointers to memory managed by Julia, then using p::Ptr{gsl_permutation} for the method signature of the wrapper and similarly in the `ccall`
ja: Cラッパーが、ユーザーがジュリアによって管理されたメモリーへのポインタを渡すことを予期しない場合は p::Ptr{gsl mutations}ラッパーの方が、同様にの"ccall"においても同様である。

source: If the condition expression x < y is true, then the corresponding block is evaluated; otherwise the condition expression x > y is evaluated, and if it is true, the corresponding block is evaluated; if neither expression is true, the else block is evaluated.
ja: 条件式x < yが真の時は、対応するブロックが評価され、さもなければ、条件式x > yが評価され、これが真の場合は、対応するブロックが評価されます。いずれの式も真でない場合、elseブロックが評価されます。
